export const staticPages = {
  about: { title: 'Σχετικα με το Μαντειο', html: 
    `
    <article>
    <p> Ενας απλός ψηφιακός βοηθός υπολογισμού βαθμολογίας για το επιτραπέζιο παιχνίδι "Χρησμοί του Ολύμπου"</p>
    <p>&nbsp;</p>
    <p>Σχεδίαση/υλοποίηση:<br><strong>Γιάννης Βαβουρανάκης</strong><br>(<a href="mailto:ivavouranakis@gmail.com">ivavouranakis@gmail.com</a>)</p>
    <p>&nbsp;</p>
    <p>Μουσική επένδυση:<br><strong>Matthew Pablo</strong></p>
    <p>&nbsp;</p>
    <p>&nbsp;</p>
    <p>&nbsp;</p>
    </article>
    <footer>
    <hr />
    <p>&nbsp;</p>

<p>© 2026 Γιάννης Βαβουρανάκης.</p>
</footer>
    ` },
  help: { title: 'Βοηθεια', html: `
<h2>Έναρξη Παιχνιδιού</h2>
<article>
<p><strong>Διαχείριση Συνεδρίας:</strong> Από το Κύριο Μενού, επιλέγοντας "Νέα Συνεδρία", η εφαρμογή διαγράφει τυχόν παλαιότερα δεδομένα και ξεκινά μια νέα καταγραφή. Επιλέγοντας "Φόρτωση Συνεδρίας", η εφαρμογή ανακτά αυτόματα τα αποθηκευμένα σύμβολα και το σκορ από την προηγούμενη φορά, εμφανίζοντας σχετικό ενημερωτικό μήνυμα.</p>
</article>
<h2>Προσθήκη Συμβόλων</h2>
<article>
<p><strong>Προσθήκη με Σάρωση (Κάμερα):</strong> Πατώντας "ΠΡΟΣΘΗΚΗ ΣΥΜΒΟΛΟΥ" και ενεργοποιώντας την κάμερα, μπορείτε να κεντράρετε ένα φυσικό σύμβολο στον ψηφιακό οδηγό. Πατώντας "ΣΑΡΩΣΗ", το ενσωματωμένο μοντέλο τεχνητής νοημοσύνης αναγνωρίζει το σύμβολο. Αν η αναγνώριση είναι σωστή, πατάτε "ΑΠΟΔΟΧΗ" για εισαγωγή στη συλλογή σας, αλλιώς "ΕΠΑΝΑΛΗΨΗ".</p>

<p><strong>Χειροκίνητη Προσθήκη & Αυτόματη Συμπλήρωση:</strong> Εναλλακτικά, μπορείτε να πληκτρολογήσετε το όνομα του συμβόλου στο πεδίο αναζήτησης. Το σύστημα δέχεται μόνο λατινικούς χαρακτήρεςκαι αριθμούς. Φιλτράρει τη λίστα συμβόλων σε πραγματικό χρόνο. Πατώντας πάνω σε οποιοδήποτε αποτέλεσμα της λίστας, το σύμβολο προστίθεται άμεσα.</p>
</article>
<h2>Παρακολούθηση Βαθμολογίας</h2>
<article>
<p><strong>Κάρτα Βαθμολογίας:</strong> Στην οθόνη "Χρησμοί", η κάρτα βαθμολογίας σάς δείχνει δύο διακριτές τιμές. Οι "Βασικοί Βαθμοί" είναι το απλό άθροισμα των αξιών όλων των συμβόλων που έχετε μαζέψει. Οι "ΣΥΝΟΛΙΚΟΙ ΒΑΘΜΟΙ" εμφανίζονται πιο έντονα και αντιπροσωπεύουν το τελικό δυναμικό σκορ, το οποίο υπολογίζεται αυτόματα βρίσκοντας τον ιδανικό συνδυασμό λέξεων που μεγιστοποιεί τους πόντους σας.</p>
</article>
<h2>Διαχείριση</h2>
<article>
<p><strong>ΣΥΜΒΟΛΑ:</strong> Εμφανίζει τα συλλεχθέντα σύμβολα. Το φόντο κάθε τετραγώνου αλλάζει χρώμα ανάλογα με την αξία του (Χαλκός για 1 πόντο, Ασήμι για 2, Χρυσός για 3, Λάπις Λάζουλι για 5).</p>

<p><strong>ΠΛΗΡΕΙΣ ΛΕΞΕΙΣ:</strong> Εμφανίζει τις λέξεις των οποίων όλα τα σύμβολα έχουν βρεθεί. Οι λέξεις που επιλέχθηκαν από τον αλγόριθμο ως μέρος του βέλτιστου συνδυασμού για το μέγιστο σκορ φέρουν την ένδειξη "(ΕΝΕΡΓΟ)" και χρυσό πλαίσιο.</p>

<p><strong>ΛΕΞΕΙΣ ΥΠΟ ΔΙΑΜΟΡΦΩΣΗ:</strong> Εμφανίζει τις λέξεις που είναι ημιτελείς (σας λείπει τουλάχιστον ένα σύμβολο, αλλά έχετε συλλέξει τουλάχιστον το μισό περιεχόμενό τους). Τα ονόματα των συμβόλων που κατέχετε ήδη εμφανίζονται με σκούρο πράσινο χρώμα, ενώ αυτά που σας λείπουν με σκούρο κόκκινο. </p>
</article>
<h2>Ρυθμίσεις</h2>
<article>
<p><strong>Ενεργοποίηση/Απενεργοποίηση Ήχου:</strong> Μέσα από την οθόνη "Επιλογές", μπορείτε να κάνετε σίγαση ή αναπαραγωγή της μουσικής υπόκρουσης πατώντας το κουμπί "Μουσική: Ναι/Όχι".</p>

<p><strong>Αλλαγή Μουσικού Κομματιού:</strong> Μπορείτε να επιλέξετε το soundtrack της αρεσκείας σας από τη σχετική λίστα επιλογών (π.χ. Ambient Mysticism, Olympian Echoes). Όλες οι προτιμήσεις σας αποθηκεύονται αυτόματα και διατηρούνται για την επόμενη φορά που θα ανοίξετε την εφαρμογή.</p>
</article>

    `},
  rules: { title: 'Κανονες', html: '<article>Οι κανόνες του παιχνιδιού...</article>' }
};