export const staticPages = {
  about: { title: 'Σχετικα με το Μαντειο', html: 
    `
    <article>
    <p> Ενας απλός ψηφιακός βοηθός υπολογισμού βαθμολογίας για το επιτραπέζιο παιχνίδι "Χρησμοί του Ολύμπου"</p>
    <p>&nbsp;</p>
    <ul><li>Σχεδίαση/υλοποίηση:<br><strong>Γιάννης Βαβουρανάκης</strong></li>
    <li>Μουσική επένδυση:<br><strong>Matthew Pablo</strong></li>
    </ul>
    <p>&nbsp;</p>
    <p>&nbsp;</p>
    </article>
    <footer>
    <hr />
    <p>&nbsp;</p>

<p>© 2026 Γιάννης Βαβουρανάκης.</p>
</footer>
    ` },
  help: { title: 'Βοηθεια', html: `
    <h2>Επιλογές εφαρμογής</h2>
    <h3>Νέα συνεδρία</h3>
    <article>
    <p>Οταν εσύ, ο Ιερέας, επιλέξεις "νέα συνεδρία", οι Ιεροφάντες του Μαντείου πρώτα ελέγχουν αν υπάρχουν αποθηκευμένα 
    στοιχεία προηγούμενης συνεδρίας. Αν υπάρχουν, τότε θα σου ζητήσουν διευκρίνιση, αν θέλεις να συνεχίσεις με την 
    αποθηκευμένη συνεδρία ή να τη διαγράψεις και να ξεκινήσεις νέα.
    </p>
    <h4>Συνέχεια</h4>
    <p>Αν επιλέξεις "Συνέχεια", τότε οι Μάντεις επαναφέρουν τα αποθηκευμένα στοιχεία και μπορείς να συνεχίσεις την
    προσπάθειά σου να κερδίσεις την Εύνοια των Ολυμπίων από εκεί που την άφησες. Η επιλογή αυτή σε οδηγεί ακριβώς στο ίδιο
    σημείο που σε οδηγεί και η κεντρική επιλογή "Φόρτωση Συνεδρίας", δηλαδή στην κεντρική αίθουσα (οθόνη) του Μαντείου,
    όπου βλέπεις το βασικό σκόρ σου, τις λέξεις που μπορείς να σχηματίσεις με τις υπάρχουσες ψηφίδες και έχεις τη
    δυνατότητα να εισάγεις την επόμενη ψηφίδα ή και να διαλέξεις από τις λέξεις που μπορείς να σχηματίσεις, για να δεις 
    σε ποιο ύψος μπορείς να ανεβάσεις τη βαθμολογία σου.</p>
    </article>
    
    
    <h2></h2>
    <article>
    <p></p>
    </article>

    `},
  rules: { title: 'Κανονες', html: '<article>Οι κανόνες του παιχνιδιού...</article>' }
};